Revit 2027 API
RebarConstraint.ConstrainsRebarEnds Method
 Returns true if this constraint constrains two rebar ends.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ConstrainsRebarEnds()
Public Function ConstrainsRebarEnds As Boolean
public:
bool ConstrainsRebarEnds()
member ConstrainsRebarEnds : unit -> bool
Return Value
Boolean
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace